{
  "profile": {
    "firstname": "Sirish",
    "lastname": "Chejerla",
    "phone": "2247161859",
    "phone_code": "+1",
    "email_personal": "chejerlasirish@gmail.com",
    "email_college": "schejerl@purdue.edu",
    "linkedin": "https://www.linkedin.com/in/sirish-c/",
    "github": "https://github.com/SirishC",
    "leetcode": "https://leetcode.com/u/SirishC/",
    "location_country": "US",
    "location_city": "Hammond",
    "location_state": "Indiana",
    "roles": ["Software Engineer", "DevOps Engineer", "Frontend Developer"]
  },
  "college": [
    {
      "name": "Purdue University Northwest",
      "location_country": "US",
      "location_city": "Hammond",
      "location_state": "Indiana",
      "GPA": 3.57,
      "level": "MS Computer Science"
    },
    {
      "name": "Amrita School of Engineering",
      "location_country": "IND",
      "location_city": "Coimbatore",
      "location_state": "Tamil Nadu",
      "GPA": 3.33,
      "level": "B.Tech Computer Science"
    }
  ],
  "work_experience": [
    {
      "dates": "Aug 2023 - Jan 2024",
      "company": "Purdue University Northwest",
      "role": "Graduate Research Assistant / Grader",
      "description": "Conducted research on gunshot detection to improve time synchronization accuracy, reducing delays from milliseconds to microseconds. Designed Purdue-TimeSync, a Python-based simulation for analyzing network delays, and performed real-time testing at the University Police Building to enhance system reliability. Additionally, evaluated assignments and provided feedback as a grader for graduate-level Algorithms and Software Engineering courses.",
      "skills": [
        "Python",
        "Machine Learning",
        "Algorithms",
        "Software Engineering",
        "Data Analysis"
      ]
    },
    {
      "dates": "Jan 2023 - May 2023",
      "company": "TradeCred",
      "role": "Frontend Developer (Freelancing)",
      "description": "Designed and implemented the website’s color scheme, improving visual consistency and increasing user engagement by 20%. Created reusable React components, reducing code duplication by 25%, and developed UI animations that boosted user interaction time by 18%. Optimized the registration flow for HUF, Company, and LLP processes, improving efficiency by 30% and reducing form errors. Ensured seamless alignment and positioning across web and mobile views, achieving a 100% legibility rate.",
      "skills": [
        "ReactJS",
        "Redux",
        "Git",
        "JavaScript",
        "CSS3",
        "Responsive Design"
      ]
    },
    {
      "dates": "Sep 2020 - Dec 2022",
      "company": "Genesys Cloud Services",
      "role": "Software Engineer",
      "description": "Developed and maintained cloud-based applications, specializing in Voicemail Microservices and Predictive Routing on AWS and Azure. Designed automation pipelines that reduced manual testing efforts by 40% using Selenium and Jest. Managed Linux and Windows test servers, ensuring 99.9% uptime and system reliability. Integrated CI/CD pipelines using Jenkins, improving deployment efficiency. Led performance testing with JMeter and Postman, optimizing API response times. Worked on AI-driven customer interaction analytics using Scikit-learn to enhance predictive accuracy.",
      "skills": [
        "Kubernetes",
        "CI/CD",
        "DevOps",
        "Jenkins",
        "JavaScript",
        "Python",
        "Docker",
        "Azure",
        "AWS",
        "Grafana",
        "Postman"
      ]
    }
  ],
  "projects": [
    {
      "date": "Jun 2020",
      "title": "Introspective Journal: Diary for Self-Realization (Springer Journal)",
      "description": "Developed a Flutter mobile app with SQLite for self-development insights visualization. Implemented sentiment analysis using NLP techniques to track user emotions. The application helps users understand behavioral patterns through analytical insights, fostering self-awareness and personal growth.",
      "link": "https://link.springer.com/chapter/10.1007/978-981-15-4218-3_23",
      "technologies": ["Flutter", "SQLite", "NLP", "Dart"]
    },
    {
      "date": "Jun 2021 – Jan 2022",
      "title": "Live Monitoring AI Prototype",
      "description": "Developed an AI-powered anomaly detection model utilizing LSTM (Long Short-Term Memory) and Grafana Metrics for real-time cloud monitoring. Deployed the model as a Flask API, significantly enhancing system scalability and improving response times. Analyzed memory leaks and anomalies by leveraging data from staging and production environments, focusing on Redis storage to evaluate memory loss and optimize performance.",
      "link": "",
      "technologies": ["Python", "Flask", "Grafana", "LSTM", "Redis"]
    },
    {
      "date": "Nov 2023",
      "title": "PNWCampusMap",
      "description": "Led the development of an interactive campus map for Purdue Northwest using React.js and Leaflet APIs. Designed a seamless user interface that allows students and visitors to navigate campus buildings, parking areas, and key landmarks efficiently. Implemented RESTful APIs for frontend-backend communication and optimized location-based searches for quick access.",
      "link": "",
      "technologies": ["React.js", "Leaflet.js", "REST API", "Node.js"]
    }
  ]
}
